index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Monads maga!</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Monads maga!</h1>
<p>
Welcome to my personal website
</p>

<hr />
<p>
<i>Hi, I am Uday Kiran(Linux, Emacs, Haskell enthusiast)</i>
</p>

<p>
<a href="https://github.com/udaycruise2903">Github</a>  |  <a href="https://twitter.com/neoatnebula">Twitter</a>
</p>
<hr />

<div id="outline-container-org68b5871" class="outline-2">
<h2 id="org68b5871">Blog</h2>
<div class="outline-text-2" id="text-org68b5871">
</div>
<ul class="org-ul">
<li><a id="org35a1f4b"></a><a href="./blog/learning-haskell.html">Learning Haskell</a><br /></li>
<li><a id="org36a53e1"></a><a href="./blog/learning-agda.html">Learning Agda</a><br /></li>
<li><a id="org3456b49"></a><a href="./blog/softwares-that-i-use.html">Softwares that i use</a><br /></li>
</ul>
</div>

<div id="outline-container-org8d7f5f4" class="outline-2">
<h2 id="org8d7f5f4">Notes</h2>
<div class="outline-text-2" id="text-org8d7f5f4">
</div>
<ul class="org-ul">
<li><a id="orgf740c17"></a><a href="./notes/haskell-programming-from-first-principles.html">Haskell Programming from First Principles</a><br /></li>
<li><a id="orgd8fd7d5"></a><a href="./notes/soh-basics-of-haskell.html">Basics-of-haskell by Bartosz Milewski (School of Haskell)</a><br /></li>
<li><a id="org48f82e4"></a><a href="./notes/get-programming-with-haskell.html">Get Programming with Haskell</a><br /></li>
<li><a id="orgd0938b0"></a><a href="./notes/haskell-mooc.html">Haskell mooc</a><br /></li>
</ul>
</div>

<div id="outline-container-org7d74179" class="outline-2">
<h2 id="org7d74179">Projects</h2>
<div class="outline-text-2" id="text-org7d74179">
</div>
<ul class="org-ul">
<li><a id="org3b8a710"></a><a href="https://github.com/udaycruise2903/khasi-ocr">Khasi OCR</a> - This is a project to create OCR model for khasi language using tesseract-ocr by LSTM layer training.<br /></li>
<li><a id="org82e1a63"></a><a href="https://github.com/udaycruise2903/khasi-dienshonhi">Khasi-dienshonhi</a> - Digitalisation project on Khasi-Khasi dictionary.<br /></li>
<li><a id="org46d5153"></a><a href="https://github.com/udaycruise2903/treasurehunt-bvj">Tresurehunt-bvj</a> - This is a Unique game of solving riddles to find the next location in a treasure hunt game (Used in a campus fest).<br /></li>
<li><a id="orgfe649ab"></a><a href="https://github.com/fpindia/fpindia-site">FPIndia Static Site</a> - I made some contributions to this project built using Ema.<br /></li>
</ul>
</div>

<div id="outline-container-org3039df1" class="outline-2">
<h2 id="org3039df1">Slides</h2>
<div class="outline-text-2" id="text-org3039df1">
</div>
<ul class="org-ul">
<li><a id="orgd8faf8c"></a><a href="./slides/project-slides.html">project slides(Discrete)</a><br /></li>
</ul>
</div>

<div id="outline-container-org8064541" class="outline-2">
<h2 id="org8064541">My Favourites</h2>
<div class="outline-text-2" id="text-org8064541">
</div>
<ul class="org-ul">
<li><a id="org9cc5f81"></a><a href="https://www.aosabook.org/en/index.html">The Architecture of Open Source Applications</a><br /></li>
</ul>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
